"""Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные"""

a = 1
b = 1.1
c = "wow"
print(type(a))
print(type(b))
print(type(c))
